import numpy as np  # Імпортуємо бібліотеку numpy для роботи з числовими масивами

# Словник, де ключі — місяці, а значення — кількість днів у кожному місяці (включаючи високосний лютий)
days = {
    1: 31, 2: 28, 3: 31, 4: 30,
    5: 31, 6: 30, 7: 31, 8: 31,
    9: 30, 10: 31, 11: 30, 12: 31
}
years = np.arange(1900, 2020 + 4, 1)

# Функція filt(x) відбирає тільки високосні роки зі списку x
def filt(x):
    # Використовуємо map для перетворення елементів у цілі числа,
    # а filter для вибору років, які задовольняють умови високосного року
    return list(map(lambda s: int(s), filter(lambda y: (y % 400 == 0 or y % 100 != 0) and y % 4 == 0, x)))

# Функція func приймає функцію, місяць і рік та друкує кількість днів у місяці,
# додаючи один день для високосного лютого
def func(func, month, year):
    # Лямбда-функція z перевіряє, чи є рік високосним, і додає один день до лютого
    z = lambda x: print(days[month] + 1) if year in func(years) and month == 2 else print(days[month])
    return z(1)  # Викликаємо лямбда-функцію z із параметром 1 для виконання умов

#filt(years)  #Тестинг
#func(filt, 3, 2004)#Тестинг
