import string  # Імпортуємо модуль string для доступу до списку літер алфавіту

occur = []  # Список для збереження кількості входжень кожної літери
letter = []  # Список для збереження літер
tot = 0  # Загальна кількість входжень всіх літер

# Цикл для кожної літери алфавіту
for x in string.ascii_lowercase:
    # Відкриваємо файл 'gadsby.txt' для читання
    with open('gadsby.txt', 'r') as f:
        y = 0  # Лічильник для входжень поточної літери
        # Читаємо файл по рядках
        for line in f:
            # Підраховуємо скільки разів поточна літера зустрічається в рядку
            y += line.lower().count(x)
        # Додаємо кількість входжень до списку occur
        occur.append(y)
        # Додаємо поточну літеру до списку letter
        letter.append(x)

        # Додаємо кількість входжень до загальної суми
        tot += y

# Обчислюємо відсоток кожної літери відносно загальної кількості літер у тексті
perc = list(map(lambda x: round(x/sum(occur)*100, 3), occur))

# Створюємо словник, де ключ - літера, а значення - її відсоток входжень
z = dict(zip(letter, perc))
# Сортуємо словник за відсотками літер у порядку спадання
z = dict(sorted(z.items(), key=lambda item: item[1], reverse=True))

# Вибираємо 5 літер з найбільшими відсотками
m = list(z.items())[0:5]
# Вибираємо 5 літер з найменшими відсотками
k = list(z.items())[-5:]
# Перетворюємо словник на список пар (літера, відсоток)
z = list(z.items())

# Виводимо 5 літер з найбільшими відсотками
for x in m:
    print(f"{x[0]}:{x[1]} %")
    
print('')  # Додаємо порожній рядок для розділення виводу

# Виводимо 5 літер з найменшими відсотками
for x in k:
    print(f"{x[0]}:{x[1]} %")
