list1 = []  # Список для найбільш популярних чоловічих імен
list2 = []  # Список для найбільш популярних жіночих імен

# Цикл по роках з 1880 по 2019
for o in range(1880, 2020):
    names_m = []  # Список для імен чоловіків
    counts_m = []  # Список для кількості чоловіків з певним ім'ям
    names_f = []  # Список для імен жінок
    counts_f = []  # Список для кількості жінок з певним ім'ям
    
    # Відкриваємо файл з іменами для поточного року
    with open(f'yob{o}.txt', 'r') as f:
        # Читаємо кожен рядок файлу
        for line in f:
            name, sex, count = line.split(',')  # Розділяємо рядок на ім'я, стать і кількість
            count = int(count)  # Перетворюємо кількість на ціле число
            
            # Якщо стать - чоловіча, додаємо ім'я та кількість до відповідних списків
            if sex == 'M':
                names_m.append(name)
                counts_m.append(count)
            else:  # Якщо стать - жіноча, додаємо ім'я та кількість до інших списків
                names_f.append(name)
                counts_f.append(count)
        
        # Додаємо до list1 ім'я, яке найбільш популярне серед чоловіків в цьому році
        list1.append(names_m[counts_m.index(max(counts_m))])
        # Додаємо до list2 ім'я, яке найбільш популярне серед жінок в цьому році
        list2.append(names_f[counts_f.index(max(counts_f))])

n = []  # Список для підрахунку кількості кожного чоловічого імені в list1
b = []  # Список для підрахунку кількості кожного жіночого імені в list2

# Перетворюємо list1 та list2 у множини, щоб прибрати дублікати
set2 = set(list2)
set1 = set(list1)

print("Male: -----")  # Виводимо заголовок для чоловічих імен

# Підраховуємо, скільки разів зустрічається кожне чоловіче ім'я в list1
for x in set1:
    n.append(list1.count(x))

# Підраховуємо, скільки разів зустрічається кожне жіноче ім'я в list2
for x in set2:
    b.append(list2.count(x))

# Створюємо словник, де ключ - ім'я, а значення - кількість його появ у list1
q = dict(zip(set1, n))
# Сортуємо словник за кількістю імен, за спаданням
q = sorted(q.items(), key=lambda item: item[1], reverse=True)

# Виводимо чоловічі імена та їх кількість
for y in q:
    print(f"{y[0]} {y[1]}")

print("Female: -----")  # Виводимо заголовок для жіночих імен

# Створюємо словник для жіночих імен
z = dict(zip(set2, b))
# Сортуємо словник за кількістю імен, за спаданням
z = sorted(z.items(), key=lambda item: item[1], reverse=True)

# Виводимо жіночі імена та їх кількість
for x in z:
    print(f"{x[0]} {x[1]}")
