print("Salary table:")  # Виводимо заголовок таблиці
salary_list = [6.4, 9.35, 11.4, 14, 23.8, 28.15, 34.7]
def z(t):
# Розрахунок нової зарплати після індексації на 30%, округленої до сотих
    salary = list(map(lambda i: round(i * 1.3, 2), t))
# Розрахунок суми індексації, що складає 30% від початкової зарплати, округленої до сотих
    diff = list(map(lambda i: round(i * 0.3, 2), t))
# Виведення таблиці зі значеннями початкової зарплати, нової зарплати та суми індексації
    for x, y, z in zip(t, salary, diff):
        print(x, y, z)  # Виводимо рядок із зарплатами для кожного працівника
def func(func, y):
    return func(y)
func(z, salary_list)
